{"_id":{"$oid":"613625523948e0165fde8ce3"},"Title":"Peter Pan","Description":"The Darling family children receive a visit from Peter Pan, who takes them to Never Land where an ongoing war with the evil Pirate Captain Hook is taking place.","Genre":{"Name":"Fantasy","Description":"Fantasy films are films that belong to the fantasy genre with fantastic themes, usually magic, supernatural events, mythology, folklore, or exotic fantasy worlds."},"Director":{"Name":"P.J. Hogan","Bio":"Paul John Hogan is an Australian writer and director, known for Muriel's Wedding (1994), The Dressmaker (2015) and Peter Pan (2003).","Birth":"1962"}}
{"_id":{"$oid":"613626d03948e0165fde8ce4"},"Title":"Pitch Perfect","Description":"Beca, a freshman at Barden University, is cajoled into joining The Bellas, her school's all-girls singing group. Injecting some much needed energy into their repertoire, The Bellas take on their male rivals in a campus competition.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Jason Moore","Bio":"Jason Moore is an American director of film, theatre and television.","Birth":"1970"}}
{"_id":{"$oid":"613629473948e0165fde8ce5"},"Title":"The Edge of Seventeen","Description":"High-school life gets even more unbearable for Nadine when her best friend, Krista, starts dating her older brother.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Kelly Fremon Craig","Bio":"Kelly Fremon Craig is a writer and director from Whittier, California. She made her directorial debut with The Edge of Seventeen.","Birth":"1981"}}
{"_id":{"$oid":"61362b5e3948e0165fde8ce7"},"Title":"Little Women","Description":"Jo March reflects back and forth on her life, telling the beloved story of the March sisters - four young women, each determined to live life on her own terms.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Greta Gerwig","Bio":"Greta Gerwig is an American actress, playwright, screenwriter, and director. She has collaborated with Noah Baumbach on several films, including Greenberg (2010), Frances Ha (2012), for which she earned a Golden Globe nomination, and Mistress America (2015).","Birth":"1983"}}
{"_id":{"$oid":"61362bf73948e0165fde8ce8"},"Title":"Riding in Cars with Boys","Description":"A single mother, with dreams of becoming a writer, has a son at the age of 15 in 1965, and goes through a failed marriage with the drug-addicted father.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Penny Marshall","Description":"Penny Marshall was an American actress, director, and producer. She came to notice in the 1970s for her role as Laverne DeFazio on the television sitcom Laverne & Shirley (1976–1983), receiving three nominations for the Golden Globe Award for Best Actress – Television Series Musical or Comedy for her portrayal.","Birth":"1943","Death":"2018"}}
{"_id":{"$oid":"61362cd63948e0165fde8ce9"},"Title":"Captain America: Civil War","Description":"Political involvement in the Avengers' affairs causes a rift between Captain America and Iron Man.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Russo Brothers","Bio":"Anthony Russo and Joseph Russo, collectively known as the Russo brothers are American film and television directors. The brothers direct most of their work jointly, and also occasionally work as producers, screenwriters, actors, and editors.","Birth":"1970"}}
{"_id":{"$oid":"61362de53948e0165fde8cea"},"Title":"Clueless","Description":"Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Amy Heckering","Bio":"Amy Heckerling is an American film director. An alumna of both New York University and the American Film Institute, she directed the commercially successful films Fast Times at Ridgemont High, National Lampoon's European Vacation, Look Who's Talking, and Clueless.","Birth":"1954"}}
{"_id":{"$oid":"61362e913948e0165fde8ceb"},"Title":"Life As We Know it","Description":"Two single adults become caregivers to an orphaned girl when their mutual best friends die in an accident.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Greg Berlanti","Bio":"Greg Berlanti is an American writer, producer and film director. He is known for his work on the television series Dawson's Creek, Brothers & Sisters, Everwood, Political Animals, Riverdale, Chilling Adventures of Sabrina and You, in addition to his contributions to DC Comics on film and television productions, including The CW's Arrowverse and the Titansverse.","Birth":"1954"}}
{"_id":{"$oid":"6136302e3948e0165fde8cec"},"Title":"Beaches","Description":"A privileged rich debutante and a cynical struggling entertainer share a turbulent, but strong childhood friendship over the years.","Genre":{"Name":"Drama","Description":"Drama Films are serious presentations or stories with settings or life situations that portray realistic characters in conflict with either themselves, others, or forces of nature. A dramatic film shows us human beings at their best, their worst, and everything in-between."},"Director":{"Name":"Garry Marshall","Bio":"Garry Marshall was an American writer and producer, known for A League of Their Own (1992), Never Been Kissed (1999) and Pretty Woman (1990). He was married to Barbara Marshall.","Birth":"1934","Death":"2016"}}
{"_id":{"$oid":"613772a28e8bf76e75620ed4"},"Title":"Avengers: Endgame","Description":"After the devastating events of Avengers: Infinity War (2018), the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Russo Brothers","Bio":"Anthony Russo and Joseph Russo, collectively known as the Russo brothers are American film and television directors. The brothers direct most of their work jointly, and also occasionally work as producers, screenwriters, actors, and editors.","Birth":"1970"}}
